In [86]:
import sqlite3

In [7]:
con = sqlite3.connect('student2.sqlite3')

In [9]:
cur = con.cursor()

In [13]:
create_table_query = '''

create table student2(
id int primary key,
name varchar(200) not null,
address varchar(200) not null,
college varchar(200) not null,
faculty varchar(20) not null,
age int not null,
gender varchar(1) not null
);

'''
cur.execute (create_table_query)

OperationalError: table student2 already exists

In [20]:
insert_data = '''
insert into student2
(id, name, address, college, faculty, age, gender)
values
(1, 'ram', 'kathmandu', 'ncit', 'IT', 18, 'm'),
(2, 'shyam', 'lalitpur', 'kmc', 'CSIT', 20, 'm'),
(3, 'gita', 'pokhara', 'ncit', 'SE', 20, 'm'),
(4, 'sita', 'kathmandu', 'ioe pulchowk', 'CE', 24, 'f');
'''
cur.execute(insert_data)

IntegrityError: UNIQUE constraint failed: student2.id

In [22]:
con.commit()

In [24]:
students = cur.execute('select * from student2')

for i in students:
    print(i)

(1, 'ram', 'kathmandu', 'ncit', 'IT', 18, 'm')
(2, 'shyam', 'lalitpur', 'kmc', 'CSIT', 20, 'm')
(3, 'gita', 'pokhara', 'ncit', 'SE', 20, 'm')
(4, 'sita', 'kathmandu', 'ioe pulchowk', 'CE', 24, 'f')

In [27]:
cur.execute ("alter table student2 add university varchar(200) not null default 'TU';")

In [55]:
o = cur.execute("select * from student2 where address = 'Lalitpur' ")

for i in o:
    print(i)

In [70]:
a = str(input('Enter address'))
#sql injection
o = cur.execute(f"select * from student2 where address = '{a}' ")

for i in o:
    print (i)

Enter address lalitpur' or true or address = 'kathmandu

(1, 'ram', 'kathmandu', 'ncit', 'IT', 18, 'm', 'TU')
(2, 'shyam', 'lalitpur', 'kmc', 'CSIT', 20, 'm', 'TU')
(3, 'gita', 'pokhara', 'ncit', 'SE', 20, 'm', 'TU')
(4, 'sita', 'kathmandu', 'ioe pulchowk', 'CE', 24, 'f', 'TU')

In [72]:
#select * from student where address = 'lalitpur' or true or address = 'kathmandu';

In [76]:
address = input('Enter the address')
# sql injection prevention
o = cur.execute('select * from student2 where address = ? ', (address,))

for i in o: 
    print(i)

Enter the address lalitpur' or true or address = 'kathmandu

In [83]:
student = (6, 'bob', 'kathmandu', 'ncit', 'IT' , 21, 'm', 'TU')

insert =('''

    insert into student2
    (id , name, address, college, faculty, age, gender, university)
    values
    (?,?,?,?,?,?,?,?);
    '''
           )

cur.execute(insert , student)
con.commit()

In [85]:
students = [ (7, 'ronaldo', 'lisbon', 'man u', 'cf', 30, 'm', 'porto'),
             (8, 'iniesta', 'sapin', 'barca', 'amf', 25, 'm', 'barca'),
             (9, 'suarez', 'urugay', 'barca', 'cf', 30, 'm', 'liverpool'),
             (10, 'messi', 'argentina', 'barca', 'rwf', 35, 'm', 'boca'),
           ]

insert = '''

    insert into student2
    (id , name, address , college, faculty , age , gender , university)
    values 
    (?,?,?,?,?,?,?,?)
    '''

for i in students:
    cur.execute(insert , i)
    con.commit()

In [ ]:
students = [(11 , 'neyamr', 'brazil', 'barca', 'lwf', 28, 'm', 'santos'),
            (12 , 'henry', 'france', 'brazil' ,'cf' , 25, 'm' , 'dsgdg')]

insert = '''
                insert into student2
                (id , name ,address , college , faculty , age , gender , university)
                values 
                (?,?,?,?,?,?,?,?)